import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-main-layout',
  templateUrl: './main-layout.component.html',
  styleUrls: ['./main-layout.component.scss']
})
export class MainLayoutComponent implements OnInit {

  info = {
    'Телефон': '8-800-555-46-88',
    'E-mail': 'office@analit.net'
  }

  contacts = [
    { city: 'Inforoom', tel: '473-2606000' },
    { city: 'Астрахань', tel: '499-7097350' },
    { city: 'Барнаул', tel: '499-7097350' },
    { city: 'Белгород', tel: '920-2002650' },
    { city: 'Брянск', tel: '499-7097350' },
    { city: 'В.Новгород-Псков', tel: '812-3090521' },
    { city: 'Владикавказ, Нальчик, Магас', tel: '499-7097350' },
    { city: 'Владимир', tel: '499-7097350' },
    { city: 'Волгоград', tel: '499-7097350' },
    { city: 'Воронеж', tel: '473-2606000' },
    { city: 'Губкин-Оскол', tel: '920-2002650' },
    { city: 'Дагестан', tel: '499-7097350' },
    { city: 'Екатеринбург', tel: '499-7097350' },
    { city: 'Златоуст', tel: '499-7097350' },
    { city: 'Иваново', tel: '499-7097350' },
    { city: 'Ижевск', tel: '499-7097350' },
    { city: 'Иркутск', tel: '499-7097350' },
    { city: 'Йошкар-Ола', tel: '499-7097350' },
    { city: 'Казань', tel: '499-7097350' },
    { city: 'Калининград', tel: '499-7097350' },
    { city: 'Калмыкия', tel: '499-7097350' },
    { city: 'Калуга', tel: '499-7097350' },
    { city: 'Кемерово', tel: '499-7097350' },
    { city: 'Киров', tel: '499-7097350' },
    { city: 'Краснодар', tel: '499-7097350' },
    { city: 'Красноярск', tel: '499-7097350' },
    { city: 'Курган', tel: '499-7097350' },
    { city: 'Курск', tel: '4712-745447' },
    { city: 'Липецк', tel: '920-2402811' },
    { city: 'Магнитогорск', tel: '499-7097350' },
    { city: 'Москва', tel: '499-7097350' },
    { city: 'Наб. Челны', tel: '927-2495786' },
    { city: 'Нижний Новгород', tel: '499-7097350' },
    { city: 'Новосибирск', tel: '499-7097350' },
    { city: 'Омск', tel: '499-7097350' },
    { city: 'Орел', tel: '499-7097350' },
    { city: 'Оренбург', tel: '499-7097350' },
    { city: 'Пенза', tel: '499-7097350' },
    { city: 'Пермь', tel: '499-7097350' },
    { city: 'Ростов', tel: '499-7097350' },
    { city: 'Рязань', tel: '499-7097350' },
    { city: 'Самара', tel: '499-7097350' },
    { city: 'Санкт-Петербург', tel: '499-7097350' },
    { city: 'Саранск', tel: '499-7097350' },
    { city: 'Саратов', tel: '499-7097350' },
    { city: 'Смоленск', tel: '499-7097350' },
    { city: 'Ставрополь', tel: '499-7097350' },
    { city: 'Сыктывкар, Воркута (респ.Коми)', tel: '499-7097350' },
    { city: 'Тамбов', tel: '920-4750323' },
    { city: 'Тверь', tel: '499-7097350' },
    { city: 'Троицк', tel: '499-7097350' },
    { city: 'Тула', tel: '499-7097350' },
    { city: 'Тюмень', tel: '499-7097350' },
    { city: 'Ульяновск', tel: '499-7097350' },
    { city: 'Уфа', tel: '499-7097350' },
    { city: 'ХМАО-Югра', tel: '499-7097350' },
    { city: 'Чебоксары', tel: '499-7097350' },
    { city: 'Челябинск', tel: '499-7097350' },
    { city: 'Чеченская республика', tel: '499-7097350' },
    { city: 'Ярославль', tel: '499-7097350' },
  ];

  constructor() { }

  ngOnInit(): void {
  }

}
